In [2]:
# Ambiente um alô Mundo
print("Alô Mundo")

Alô Mundo

# SqlAlchemy é uma biblioteca de ORM (para conectar com o banco)

- Conexão fácil
- Mapeamento de Tabela com Classe (ORM)
- Resolve um conflito de tecnologias com paradigmas diferentes.
- Tudo fique orientado a objetos

In [2]:
! pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.32-cp312-cp312-win_amd64.whl.metadata (9.8 kB)
Collecting typing-extensions>=4.6.0 (from sqlalchemy)
  Using cached typing_extensions-4.12.2-py3-none-any.whl.metadata (3.0 kB)
Collecting greenlet!=0.4.17 (from sqlalchemy)
  Using cached greenlet-3.0.3-cp312-cp312-win_amd64.whl.metadata (3.9 kB)
Downloading SQLAlchemy-2.0.32-cp312-cp312-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ----------------------------------- ---- 1.8/2.1 MB 10.1 MB/s eta 0:00:01
   ---------------------------------------- 2.1/2.1 MB 10.6 MB/s eta 0:00:00
Using cached greenlet-3.0.3-cp312-cp312-win_amd64.whl (293 kB)
Using cached typing_extensions-4.12.2-py3-none-any.whl (37 kB)
Installing collected packages: typing-extensions, greenlet, sqlalchemy
Successfully installed greenlet-3.0.3 sqlalchemy-2.0.32 typing-extensions-4.12.2

In [3]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\ead\desktop\projetofinal_manha\.venv\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ead\desktop\projetofinal_manha\.venv\lib\site-packages (from pandas) (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ead\desktop\projetofinal_manha\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ead\desktop\projetofinal_manha\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ead\desktop\projetofinal_manha\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\ead\desktop\projetofinal_manha\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [4]:
! pip install pymysql

Collecting pymysql
  Using cached PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Using cached PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

In [2]:
import pandas as pd

In [3]:
from sqlalchemy import create_engine

In [4]:
import pymysql

Senha ?
- password: senai@123

In [6]:
# biblioteca para converter e resolver problema do @ (se tiver na senha do banco)
import urllib.parse

# Qual o usuário do banco e a senha?
user = 'root'
password = urllib.parse.quote_plus('senai@123')

# password = ''
# password = 'root'

# Qual o host e o banco?
host = 'localhost'
database = 'projetodiario1'

# Connection_string : string com TODAS as informações da conexão
connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'

# criando a conexão
engine = create_engine(connection_string)

#  escrever uma consulta SQL
query_alunos = "SELECT * FROM aluno"

# criar um dataframe com a consulta SQL
df_alunos = pd.read_sql(query_alunos, engine)

df_alunos

    id        ra              Nome  tempoestudo  rendafamiliar
0    1  12345678              None            0            NaN
1    2  12345679              None            0            NaN
2    3  12345608              None            0            NaN
3    4  12375678              None            0            NaN
4    5  12345878              None            0            NaN
..  ..       ...               ...          ...            ...
79  80  15463346  Ricardo Ferreira           14         3000.0
80  81  15463347    Gabriela Silva           22         3600.0
81  82  15463348     Lucas Pereira           18         3200.0
82  83  15463349     Juliana Costa           17         3100.0
83  84  15463350     Eduardo Souza           15         3300.0

[84 rows x 5 columns]

Bibliotecas para Data Science 
- Pandas (EDA - Análise Exploratório de Dados)
- Scikit-Learn (Fundamentos de Inteligencia Artificial)
- NumPy (Matemática Complexa com Abstração)

# Salvando o DataFrame
- .csv
- .xlsx
- .json
- .sql
- .html
- .xml

In [7]:
csv_filename = "alunos.csv"
df_alunos.to_csv(csv_filename, index=False)

# crie uma nova célula que salve o dataframe no formato .json

In [8]:
JSON = "aluno.json"
df_alunos.to_json(JSON, index=False)

In [9]:
df_alunos.columns

Index(['id', 'ra', 'Nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

In [10]:
df_tempo_renda = df_alunos[['tempoestudo', 'rendafamiliar']]

In [11]:
df_tempo_renda

    tempoestudo  rendafamiliar
0             0            NaN
1             0            NaN
2             0            NaN
3             0            NaN
4             0            NaN
..          ...            ...
79           14         3000.0
80           22         3600.0
81           18         3200.0
82           17         3100.0
83           15         3300.0

[84 rows x 2 columns]

In [12]:
type(df_tempo_renda)

pandas.core.frame.DataFrame

Exercício: Como mostrar os registros do DataFrame usando fatiamento?

In [13]:
len(df_alunos)

84

In [14]:
df_alunos[25:30]

    id        ra              Nome  tempoestudo  rendafamiliar
25  26  15463292      Beatriz Lima           22         5000.0
26  27  15463293     Felipe Santos           14         2700.0
27  28  15463294    Fernanda Silva           16         3200.0
28  29  15463295     Eduardo Costa           11         2900.0
29  30  15463296  Tatiane Ferreira           19         3300.0

# Crie uma serie apenas com a renda familiar?

In [15]:
renda_familiar = df_alunos['rendafamiliar']
type(renda_familiar)

pandas.core.series.Series

In [16]:
renda_familiar = pd.Series([renda_familiar]); 
type(renda_familiar)

pandas.core.series.Series

# Funções básicas
1 retorne as duas primeras linhas de um DataFrame:

In [17]:
df_alunos[0:2]

   id        ra  Nome  tempoestudo  rendafamiliar
0   1  12345678  None            0            NaN
1   2  12345679  None            0            NaN

In [18]:
df_alunos.iloc[0:2]

   id        ra  Nome  tempoestudo  rendafamiliar
0   1  12345678  None            0            NaN
1   2  12345679  None            0            NaN

In [19]:
df_alunos.head(2)

   id        ra  Nome  tempoestudo  rendafamiliar
0   1  12345678  None            0            NaN
1   2  12345679  None            0            NaN

# Exercicio 02: agora retorne as duas ultimas linhas da amostra

In [20]:
df_alunos.tail(2)

    id        ra           Nome  tempoestudo  rendafamiliar
82  83  15463349  Juliana Costa           17         3100.0
83  84  15463350  Eduardo Souza           15         3300.0

In [21]:
df_alunos.iloc[-2:]

    id        ra           Nome  tempoestudo  rendafamiliar
82  83  15463349  Juliana Costa           17         3100.0
83  84  15463350  Eduardo Souza           15         3300.0

Exercicio 03: retorne uma tupla com números de linhas e colunas

In [22]:
df_alunos.columns

Index(['id', 'ra', 'Nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

In [23]:
df_alunos.shape

(84, 5)

In [24]:
df_alunos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84 entries, 0 to 83
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             84 non-null     int64
 1   ra             84 non-null     object
 2   Nome           64 non-null     object
 3   tempoestudo    84 non-null     int64
 4   rendafamiliar  64 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 3.4+ KB

In [25]:
df_alunos.describe()

              id  tempoestudo  rendafamiliar
count  84.000000    84.000000      64.000000
mean   42.500000    13.023810    3228.125000
std    24.392622     7.847916     351.174334
min     1.000000     0.000000    2500.000000
25%    21.750000    10.750000    3000.000000
50%    42.500000    15.500000    3200.000000
75%    63.250000    19.000000    3400.000000
max    84.000000    23.000000    5000.000000

união 
- concat()
- merge()

# crir um novo DataFrame da tabela diariobordo do MySql

In [26]:
query_diariobordo = "SELECT  * FROM diariobordo"

# criar um dataframe com a consulta SQL
df_diariobordo = pd.read_sql(query_diariobordo, engine)

df_diariobordo

   id             texto            datahora  fk_aluno_id
0   1  a aula foi legal 2024-08-01 19:09:00           13
1   2  a aula foi legal 2024-08-01 19:09:00           13
2   3    aula muito boa 2024-08-01 19:09:00            9

In [27]:
df_diariobordo

   id             texto            datahora  fk_aluno_id
0   1  a aula foi legal 2024-08-01 19:09:00           13
1   2  a aula foi legal 2024-08-01 19:09:00           13
2   3    aula muito boa 2024-08-01 19:09:00            9

In [28]:
query_avaliacao = "SELECT * FROM avaliacao"

df_avaliacao = pd.read_sql(query_avaliacao, engine)

df_avaliacao

   id  nota1  nota2  nota3  nota4  fk_aluno_id
0   1     20     24     25     22            1
1   2     22     14     19     14            2
2   3     14     16     12    156            5

In [29]:
# Realizar o Join
resultado = pd.merge(df_diariobordo, df_alunos, how='join', left_on='fk_aluno_id', right_on='id')

UnboundLocalError: cannot access local variable 'lidx' where it is not associated with a value